In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
#import modules and read the dataset 
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv("/content/drive/MyDrive/cat_delhi_makaan_mapped.csv")

In [22]:
df.head()

   Unnamed: 0 suburb_name  ... prop_age             Ward_Name
0           8       Other  ...        3  DELHI CANTT CHARGE 6
1           9       Other  ...        3  DELHI CANTT CHARGE 7
2          10       Other  ...        1  DELHI CANTT CHARGE 7
3          11       Other  ...        3  DELHI CANTT CHARGE 7
4          12       Other  ...        3  DELHI CANTT CHARGE 7

[5 rows x 9 columns]

In [23]:
dfp = df['price']
dfp

0        (4e+06,4.5e+06]
1        (1.5e+07,2e+07]
2        (2e+07,2.5e+07]
3        (1.5e+07,2e+07]
4        (1.5e+07,2e+07]
              ...
56126    (1.5e+06,2e+06]
56127    (1.5e+06,2e+06]
56128    (2.5e+06,3e+06]
56129    (2.5e+06,3e+06]
56130    (7e+06,7.5e+06]
Name: price, Length: 56131, dtype: object

In [34]:
pd.options.display.float_format = '{:,.2f}'.format

In [35]:
#Splitting done on basis of ','
def price_split(df,):
  df[['low range','high range']] = df.price.str.split(",",1,expand=True)
  #df['Company Name'] = df['Comp Name'].str[:-1]
  #df=df.drop(['Comp Name'], axis = 1)
  return df

In [36]:
price_split(dfp)

                 price low range high range
0      (4e+06,4.5e+06]    (4e+06   4.5e+06]
1      (1.5e+07,2e+07]  (1.5e+07     2e+07]
2      (2e+07,2.5e+07]    (2e+07   2.5e+07]
3      (1.5e+07,2e+07]  (1.5e+07     2e+07]
4      (1.5e+07,2e+07]  (1.5e+07     2e+07]
...                ...       ...        ...
56126  (1.5e+06,2e+06]  (1.5e+06     2e+06]
56127  (1.5e+06,2e+06]  (1.5e+06     2e+06]
56128  (2.5e+06,3e+06]  (2.5e+06     3e+06]
56129  (2.5e+06,3e+06]  (2.5e+06     3e+06]
56130  (7e+06,7.5e+06]    (7e+06   7.5e+06]

[56131 rows x 3 columns]

In [37]:
import re

In [38]:
#dfp['low range'].replace("(", "")
#re.sub('[()]', '', dfp['low range'])
rr = dfp.replace('(','').replace(')','')

In [12]:
len(rr.price[0])

15

In [39]:
dfp['low range']=dfp['low range'].str.replace("(","")

In [40]:
dfp['high range']=dfp['high range'].str.replace("]","")

In [41]:
dfp

                 price low range high range
0      (4e+06,4.5e+06]     4e+06    4.5e+06
1      (1.5e+07,2e+07]   1.5e+07      2e+07
2      (2e+07,2.5e+07]     2e+07    2.5e+07
3      (1.5e+07,2e+07]   1.5e+07      2e+07
4      (1.5e+07,2e+07]   1.5e+07      2e+07
...                ...       ...        ...
56126  (1.5e+06,2e+06]   1.5e+06      2e+06
56127  (1.5e+06,2e+06]   1.5e+06      2e+06
56128  (2.5e+06,3e+06]   2.5e+06      3e+06
56129  (2.5e+06,3e+06]   2.5e+06      3e+06
56130  (7e+06,7.5e+06]     7e+06    7.5e+06

[56131 rows x 3 columns]

In [43]:
dfp["low range"] = dfp["low range"].astype(float)
dfp["high range"] = dfp["high range"].astype(float)

In [44]:
dfp["low range"] = dfp["low range"].astype(int)
dfp["high range"] = dfp["high range"].astype(int)

In [45]:
#dfp["low range"] = pd.to_numeric(dfp["low range"])
#dfp["low range"] = pd.to_numeric(dfp["high range"])
dfp
dfp["low range"] = dfp['low range'].apply(lambda x : "{:,}".format(x))
dfp["high range"] = dfp['high range'].apply(lambda x : "{:,}".format(x))

In [46]:
dfp['price']='INR ' + dfp['low range'].astype(str)+'-'+dfp['high range'].astype(str)

In [47]:
dfp

                           price   low range  high range
0        INR 4,000,000-4,500,000   4,000,000   4,500,000
1      INR 15,000,000-20,000,000  15,000,000  20,000,000
2      INR 20,000,000-25,000,000  20,000,000  25,000,000
3      INR 15,000,000-20,000,000  15,000,000  20,000,000
4      INR 15,000,000-20,000,000  15,000,000  20,000,000
...                          ...         ...         ...
56126    INR 1,500,000-2,000,000   1,500,000   2,000,000
56127    INR 1,500,000-2,000,000   1,500,000   2,000,000
56128    INR 2,500,000-3,000,000   2,500,000   3,000,000
56129    INR 2,500,000-3,000,000   2,500,000   3,000,000
56130    INR 7,000,000-7,500,000   7,000,000   7,500,000

[56131 rows x 3 columns]

In [48]:
df['price'] = dfp['price']

In [49]:
df

       Unnamed: 0  suburb_name  ... prop_age             Ward_Name
0               8        Other  ...        3  DELHI CANTT CHARGE 6
1               9        Other  ...        3  DELHI CANTT CHARGE 7
2              10        Other  ...        1  DELHI CANTT CHARGE 7
3              11        Other  ...        3  DELHI CANTT CHARGE 7
4              12        Other  ...        3  DELHI CANTT CHARGE 7
...           ...          ...  ...      ...                   ...
56126       83357        Other  ...        1         SHASTRI NAGAR
56127       83362        Other  ...        2         SHASTRI NAGAR
56128       83374  North Delhi  ...        5         SHASTRI NAGAR
56129       83388        Other  ...        1         SHASTRI NAGAR
56130       83412        Other  ...        4           TUKHMIR PUR

[56131 rows x 9 columns]